const text ='اگر طرفدار فیلم های اکشن بوده باشید بدون شک چندین و چند فیلم اکشن درباره قاتل های حرفه ای تماشا کرده اید که درهمه آنها یک نفر به دنبال افرادی مشخص شده می رود و یکی پس از دیگری آن ها را به قتل می رساند. فیلم Avaکه دقیقا چنین داستانی را در خود جای داده است.یک تفاوت مهم با دیگر فیلم های سبک خوددارد.'
export const posts=[
    {
        id: '#1',
        title: 'بلاگ نبرد هوش مصنوعی شریف',
        description: text,
        date: '۲۰بهمن ۱۳۹۹',
        slug: 'post-number-1',
        comments:[
        ],
      },
      {
        id: '#2',
        title: 'بلاگ نبرد هوش مصنوعی شریف',
        description: text,
        date: '۲۰بهمن ۱۳۹۹',
        slug: 'post-number-2',
        comments:[
        ],
      },
      {
        id: '#3',
        title: 'بلاگ نبرد هوش مصنوعی شریف',
        description: text,
        date: '۲۰بهمن ۱۳۹۹',
        slug: 'post-number-3',
        comments:[
        ],
      },
]
