<template>
  <v-app>
    <Header color="primary" />
    <div class="first-slider" style="position: relative;">
      <div class="slider-text">
        <div style="margin-top: 20vh; font-size: 6rem;">
          سوالات متداول
        </div>
        <div style="font-size: 50px;">
          <span style="  color: transparent; border: white; -webkit-text-stroke: 2px white; font-size: 6rem;">و</span>
          <span style="font-size: 6rem;">قوانین</span>
        </div>
        <div>
          این مجموعه برای پاسخگویی به سوالات رایج در مورد نبرد هوش مصنوعی شریف
          <br />
          و قوانین آن طراحی شده است
        </div>
      </div>
      <div class="vl"></div>
    </div>

    <div class="titles">
      <div class="title" v-for="(subject, index) in faq" :key="index">
        {{ subject.title }}
      </div>
    </div>
    <v-container>
      <div v-for="(subject, index) in faq" :key="index">
        <div class="fag-title-for-show">{{ subject.title }}</div>
        <v-row class="mb-10">
          <v-col v-for="(question, index) in subject.questions" :key="index" cols="12" sm="6" lg="4" xl="3">
            <div class="faq-card">
              <div class="faq-card-title">
                <v-icon right color="primary" size="55">
                  mdi-calendar
                </v-icon>
                {{ question.title }}
              </div>
              <p class="faq-card-text">
                {{ question.answer }}
              </p>
            </div>
          </v-col>
        </v-row>
      </div>
    </v-container>
  </v-app>
</template>

<script>
import Header from '~/components/landing/Header.vue';
export default {
  auth: false,
  layout: 'landing',
  components: { Header },
  data() {
    return {
      faq: [
        {
          title: 'عمومی',
          questions: [
            {
              title: ' نبرد هوش مصنوعی چگونه کار می کند',
              answer:
                'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان.',
            },
            {
              title: ' نبرد هوش مصنوعی چگونه کار می کند',
              answer:
                'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان.',
            },
            {
              title: ' نبرد هوش مصنوعی چگونه کار می کند',
              answer:
                'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان.',
            },
          ],
        },
        {
          title: 'عمومی',
          questions: [
            {
              question: ' نبرد هوش مصنوعی چگونه کار می کند',
              answer:
                'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد.',
            },
            {
              question: ' نبرد هوش مصنوعی چگونه کار می کند',
              answer:
                'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد.',
            },
            {
              question: ' نبرد هوش مصنوعی چگونه کار می کند',
              answer:
                'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد.',
            },
          ],
        },
      ],
    };
  },
};
</script>

<style lang="scss">
@import 'assets/variables.scss';

.first-slider {
  background-color: var(--v-primary-base);
  height: 100vh;
}
.slider-text {
  margin-right: 50px;
  position: absolute;
}
.vl {
  border-left: 3px solid white;
  height: 150px;
  position: absolute;
  left: 49%;
  bottom: 0px;
}
.titles {
  position: sticky;
  top: 0;
  display: flex;
  justify-content: center;
  background-color: map-get($map: $material-dark, $key: 'background');
  z-index: 2;
}
.title {
  margin: auto 50px;
  padding: 20px 0px;
}
.fag-title-for-show {
  font-size: 4rem;
  color: var(--v-primary-base);
  margin-bottom: 40px;
}

.faq-card {
  border: 3px solid var(--v-primary-base);
  padding: 20px;
}
.faq-card-title {
  display: inline-block;
  font-size: 2rem;
}
</style>
